УТ_для_edt/src/Catalogs/CRM_АдресаОфисовКомпании/CRM_АдресаОфисовКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_АдресаОфисовКомпании</name>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ПредставлениеАдреса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_АдресаОфисовКомпании/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОписаниеМетки(АдресСсылка) Экспорт
	ОписаниеМетки = Новый Структура;
	ОписаниеМетки.Вставить("Заголовок","<a href = ""#"">"+АдресСсылка.Владелец.Наименование+"</a>");
	ОписаниеМетки.Вставить("Описание", "<b>"+АдресСсылка.Наименование+"</b>");
	ОписаниеМетки.Вставить("Подвал","<b>Адрес: </b>" + АдресСсылка.ПредставлениеАдреса);
	ОписаниеМетки.Вставить("Подсказка",);
	ОписаниеМетки.Вставить("Широта", ?(АдресСсылка.Широта = 0, 55.751574, АдресСсылка.Широта));
	ОписаниеМетки.Вставить("Долгота", ?(АдресСсылка.Долгота = 0, 37.573856, АдресСсылка.Долгота));
	ОписаниеМетки.Вставить("Наименование", АдресСсылка.Наименование);
	ОписаниеМетки.Вставить("Адрес", АдресСсылка.ПредставлениеАдреса);
	Возврат ОписаниеМетки;
КонецФункции

#КонецОбласти
